# math

In [67]:
import numpy as np 
import pandas as pd

In [68]:
data1 = {
    'name' : ['kaushik','kajal','yash','dhara','sanjay'],
    'age' : [22,23,21,23,24],
    'dept' : ['IT','HR',"IT",'HR','IT'],
    'cpmpany' : ['Google','TCS','Google','TCS','Amazon']
}

In [69]:
df = pd.DataFrame(data1)

In [70]:
df.rename(columns={'cpmpany' : 'company'},inplace=True)

In [71]:
df['lpa'] = [12,13,14,11,10]

In [72]:
df.sum()

name       kaushikkajalyashdharasanjay
age                                113
dept                        ITHRITHRIT
company       GoogleTCSGoogleTCSAmazon
lpa                                 60
dtype: object

In [73]:
df['lpa'].mean()

np.float64(12.0)

In [74]:
df['age'].max()

np.int64(24)

In [75]:
df['lpa'].min()

np.int64(10)

In [76]:
df['lpa'].median()

np.float64(12.0)

# column accessign

In [77]:
df['company']

0    Google
1       TCS
2    Google
3       TCS
4    Amazon
Name: company, dtype: object

In [78]:
# multiple column 
df[['name','age','company']]

      name  age company
0  kaushik   22  Google
1    kajal   23     TCS
2     yash   21  Google
3    dhara   23     TCS
4   sanjay   24  Amazon

In [79]:
df.set_index('name',inplace=True)

In [80]:
df

         age dept company  lpa
name
kaushik   22   IT  Google   12
kajal     23   HR     TCS   13
yash      21   IT  Google   14
dhara     23   HR     TCS   11
sanjay    24   IT  Amazon   10

# fatch data in row wise 

### iloc & loc

In [81]:
# single row 
df.iloc[0]

age            22
dept           IT
company    Google
lpa            12
Name: kaushik, dtype: object

In [82]:
# multilpe row 
df.iloc[[0,1,2]]

         age dept company  lpa
name
kaushik   22   IT  Google   12
kajal     23   HR     TCS   13
yash      21   IT  Google   14

In [83]:
df[0:3]

         age dept company  lpa
name
kaushik   22   IT  Google   12
kajal     23   HR     TCS   13
yash      21   IT  Google   14

In [84]:
df.loc[['kaushik','kajal']]

         age dept company  lpa
name
kaushik   22   IT  Google   12
kajal     23   HR     TCS   13

In [85]:
df.iloc[0:2,0:2]

         age dept
name
kaushik   22   IT
kajal     23   HR

In [92]:
df.iloc[0:2]

         age dept company  lpa
name
kaushik   22   IT  Google   12
kajal     23   HR     TCS   13

In [95]:
df.loc['kaushik':'kajal','age':'company']

         age dept company
name
kaushik   22   IT  Google
kajal     23   HR     TCS